#lang racket
(require "../structs.rkt")
(provide (all-defined-out))

;; 英灵召唤的英雄品质
(define spirits-rarities
  (list
   (rarity "5星领主英雄" #e0.0004 5 #t
           '(
             "阿拉夏" "摩瑞甘" "阿贾克斯" "双生魔"
             "维诺玛" "哈尔兹王" "托罗多" "菈雅"
             ))
   (rarity "5星普通英雄" #e0.0046 5 #f
           '(
             "萨拉查" "诺克图恩" "哈苏" "雷古拉斯"
             "兹丽忒" "卡利普索" "艾洛温" "瓦尔基拉"
             "柯罗莎" "塞勒涅" "沙米尔" "阿瑞斯"
             "勒席尔" "傲慢" "泽鲁斯" "憎恶"
             "尼克斯" "弗尔西" "奥里姆" "玛乌"
             "埃普萨" "克莉娅" "玛格达" "阿哲尔"
             "刻耳柏洛斯" "西拉斯" "赛特拉姆" "艾莉恩"
             "喀美特" "康斯坦丝" "维尔娜" "埃泽恩"
             "克拉奇" "莎蒂" "赫克斯" "布洛基尔"
             "玛格姆斯" "凯" "康尼莎" "塞雷菲娜"
             "瑞扎戈" "艾洛拉" "伊迪丝" "阿纳伊"
             "瓦列里娅" "托尔斯克" "莱拉" "波瑞斯"
             "路修斯"
             ))
   (rarity "4星领主英雄" #e0.0012 4 #t
           '(
             "暴怒" "艾因" "伊恩" "露娜瑞亚"
             "派洛斯" "雷电" "埃索尔德"
             ))
   (rarity "4星普通英雄" #e0.0788 4 #f
           '(
             "迪蒙" "科莫多" "暴食" "焦痕"
             "塞克隆" "沃洛斯" "德莫斯" "詹夸尔"
             "埃斯特丽德" "塞蕾妮" "达琳" "马尔丽"
             "索雷尔" "纳布拉斯" "纳齐娅" "贪婪"
             "伊欧娜" "伊玛尼" "奥西伦" "阿索斯"
             "塞尔卡斯" "奈萨特" "艾" "劳雷尔"
             "布蕾妮" "摩尔" "布鲁诺" "戈德莉尔"
             "塔兹拉" "迪奥温" "哈庞" "艾斯米"
             "莱特洛克" "米丹" "尼桑黛" "莉莉"
             "德洛丽丝" "哈洛" "阿特洛克斯" "卡利纳"
             ))
   (rarity "3星领主英雄" #e0.0399 3 #t
           '(
             "波鲁特" "达格娜" "尼禄"
             ))
   (rarity "3星普通英雄" #e0.3751 3 #f
           '(
             "雷克斯" "格伦" "纳尔薇" "斯卡尔夫"
             "纳什" "德西姆斯" "巴克莱" "奥格鲁"
             "鲁图" "哥尔扎" "谢罗尔" "杜拉德尔"
             "莫雷娜" "阿玛尔" "囚克" "卓戈"
             "尼鲁卡斯" "伏塔斯" "所瑟斯" "贡巴"
             "努尼娅" "卡米尔" "亚伦" "斯普灵"
             "奥塔姆"
             ))
   (rarity "2星普通英雄" #e0.5 2 #f
           '(
             "海顿" "阿洛" "哈尔德" "乔纳斯"
             "莱德" "罗杰斯" "红鼻子" "普雷特"
             "割刀" "利亚姆" "斯克里夫" "瓦格拉克"
             "兰林"
             ))))

;; 神圣召唤的英雄品质
(define divine-rarities
  (list
   (rarity "5星领主英雄" #e0.004 5 #t
           '(
             "阿拉夏" "摩瑞甘" "阿贾克斯" "双生魔"
             "维诺玛" "哈尔兹王" "托罗多" "菈雅"
             ))
   (rarity "5星普通英雄" #e0.056 5 #f
           '(
             "萨拉查" "诺克图恩" "哈苏" "雷古拉斯"
             "兹丽忒" "卡利普索" "艾洛温" "瓦尔基拉"
             "柯罗莎" "塞勒涅" "沙米尔" "阿瑞斯"
             "勒席尔" "傲慢" "泽鲁斯" "憎恶"
             "尼克斯" "弗尔西" "奥里姆" "玛乌"
             "埃普萨" "克莉娅" "玛格达" "阿哲尔"
             "刻耳柏洛斯" "西拉斯" "赛特拉姆" "艾莉恩"
             "喀美特" "康斯坦丝" "维尔娜" "埃泽恩"
             "克拉奇" "莎蒂" "赫克斯" "布洛基尔"
             "玛格姆斯" "凯" "康尼莎" "塞雷菲娜"
             "瑞扎戈" "艾洛拉" "伊迪丝" "阿纳伊"
             "瓦列里娅" "托尔斯克" "莱拉" "波瑞斯"
             "路修斯"
             ))
   (rarity "4星领主英雄" #e0.0122 4 #t
           '(
             "暴怒" "艾因" "伊恩" "露娜瑞亚"
             "派洛斯" "雷电" "埃索尔德"))
   (rarity "4星普通英雄" #e0.9278 4 #f
           '(
             "迪蒙" "科莫多" "暴食" "焦痕"
             "塞克隆" "沃洛斯" "德莫斯" "詹夸尔"
             "埃斯特丽德" "塞蕾妮" "达琳" "马尔丽"
             "索雷尔" "纳布拉斯" "纳齐娅" "贪婪"
             "伊欧娜" "伊玛尼" "奥西伦" "阿索斯"
             "塞尔卡斯" "奈萨特" "艾" "劳雷尔"
             "布蕾妮" "摩尔" "布鲁诺" "戈德莉尔"
             "塔兹拉" "迪奥温" "哈庞" "艾斯米"
             "莱特洛克" "米丹" "尼桑黛" "莉莉"
             "德洛丽丝" "哈洛" "阿特洛克斯" "卡利纳"
             ))))

;; 远古召唤的英雄品质
(define ancient-rarities
  (list
   (rarity "5星领主英雄" #e0.008 5 #t
           '(
             "托罗多" "哈尔兹王" "阿拉夏" "摩瑞甘"
             "双生魔" "维诺玛" "阿贾克斯" "格汉"
             "埃尔德" "菈雅" "黛米" "伊欧沃"
             "索尔卡登斯" "瓦尔德隆" "伊米莱特" "居鲁士"
             ))
   (rarity "5星普通英雄" #e0.01 5 #f
           '(
             "卢加鲁" "达苏弥" "刻耳柏洛斯" "卡埃德"
             "萨迦克" "卡赫利安" "克劳上将" "乌瑞丁"
             "吕布"
             ))
   (rarity "4星领主英雄" #e0.06 4 #t
           '(
             "暴怒" "艾因" "埃索尔德" "露娜瑞亚"
             "伊恩" "雷电" "派洛斯"
             ))
   (rarity "4星普通英雄" #e0.05 4 #f
           '(
             "布蕾妮" "索雷尔" "塞蕾妮" "纳布拉斯"
             "布鲁诺" "莱特洛克" "莉薇安" "贪梦"
             "阿维林" "戈德莉尔" "伊欧娜" "阿特洛克斯"
             ))
   (rarity "3星领主英雄" #e0.27 3 #t
           '(
             "波鲁特" "达格娜" "尼禄"
             ))
   (rarity "3星普通英雄" #e0.602 3 #f
           '(
             "雷克斯" "格伦" "纳尔薇" "斯卡尔夫"
             "纳什" "德西姆斯" "巴克莱" "奥格鲁"
             "鲁图" "哥尔扎" "谢罗尔" "杜拉德尔"
             "莫雷娜" "阿玛尔" "囚克" "卓戈"
             "尼鲁卡斯" "伏塔斯" "所瑟斯" "贡巴"
             "努尼娅" "卡米尔" "亚伦" "斯普灵"
             "奥塔姆"
             ))
   ))
